vvpai9/Keil/Keil_v5/ARM/Pack/.Web/AnalogDevices.ADuCM410_DFP.pdsc
<?xml version="1.0" encoding="utf-8"?>



<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">

   <vendor>AnalogDevices</vendor>

   <name>ADuCM410_DFP</name>

   <url>https://download.analog.com/tools/EZBoards/ADuCM41x/Releases/</url>

   <description>Analog Devices ADuCM410 Device Support and Examples</description>

   <supportContact>http://www.analog.com/en/content/technical_support_page/fca.html</supportContact>

   <license>License\License.txt</license>  

	

   <releases>

      <release version="1.7.0">

      First creation of CMSIS DEVICE PACK

		Included WDT and FlashDma example project

		Tested on FPGA

      </release>

      <release version="0.2.0">

      Included KEIL projects

      </release>

      <release version="0.3.0">

      What's New    

      M410_DmaDacAdc example demonstrate ADC measuring DAC and DMA generated sine wave. Refer to DMA chapter of User guide for details

      M410_DmaSpiAdc example demonstrate generating sine wave using DMA with SPI protocol.Refer to DMA chapter of User guide for details 

      M410_SpiMdio example imitate MDIO master using SPI three pin mode

      Updated device header file, refer to header file update section in the end of this notes.

      M410_SpiSlaveReceive example to set SPI as slave



      Bug Fixes 

      ClkMuxCfg function, check PLL status before switching PLL clock

      ClkDivCfg function, swtich to internal OSC for clock divider opertion and switch back after division.

      update IAR linker file(.icf) to support changing Vector table address in IAR linker editor



      Other changes  

      ADC_SETUP_t type in AdcLib.h, pinCnvType changed to pinMode

      Removed SYNC and interpolation mode of VDAC

      </release>

   </releases>



   <keywords>

      <!-- keywords for indexing -->

      <keyword>Analog Devices</keyword>

      <keyword>Device Support</keyword>

      <keyword>Device Family Package Analog Devices</keyword>

      <keyword>ADuCM410</keyword>

		  <keyword>Optical</keyword>

   </keywords>

	

	

   <devices>

      <family Dfamily="ADuCM41x Series" Dvendor="Analog Devices:1">

      <!-- ******************************  ADuCM410  ****************************** -->

      <device Dname="ADuCM410">

        <processor Dcore="Cortex-M33" DcoreVersion="r0p4" Dfpu="SP_FPU" Dmpu="NO_MPU" Dtz="NO_TZ" Dendian="Little-endian" Dclock="16000000"/>  

        <!-- <processor Dcore="Cortex-M4" DcoreVersion="r0p4" Dfpu="SP_FPU"  Dendian="Little-endian" Dclock="16000000"/> -->

        <book    name="Documentation/arm_cortex_m33_dgug_100235_0002_00_en.pdf"           title="Cortex-M33 Generic User Guide"/>

        <debug      svd="SVD/ADuCM410.svd"/>

        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>

        <memory     id="IRAM1"                      start="0x20000000"  size="0x18000"     init   ="1"   default="1"/>

        <algorithm  name="Flash/ADuCM410.FLM"  start="0x00000000"  size="0x80000"   default="1"/>

        <description>

The ADuCM410 is a Precision Analog Microcontroller, 16-Bit Analog I/O with MDIO interface, ARM Cortex M33

Typical applications include Optical networking – 100G, 200G and 400G modules, Industrial control and automation systems,

Smart sensors, precision instrumentation and Base station systems.

        </description>

        <feature type="ADC"           n="16"      m="16"    name="Multichannel, 16-bit 2MSPS ADC"/>

        <feature type="DAC"           n="9"       m="16"/>

        <feature type="AnalogOther"   n="9"       name="0 mA to 200 mA IDACs"/>

        <feature type="Other"         n="1"       name="MDIO slave up to 4 MHz"/>

        <feature type="PLL"           n="1"       name="160 MHz PLL with programmable divider"/>

        <feature type="IntRC"         n="16000000" m="16000000"      name="Internal oscillator with +/-3% accuracy"/>

        <feature type="XTAL"          n="16000000" m="16000000"      name="External Crystal Oscillator"/>

        <feature type="Memory"        n="524228"  name="512kB Flash memory"/>

        <feature type="Memory"        n="131072"   name="96kB SRAM"/>

        <feature type="SPI"           n="3"       m="40000000"/>

        <feature type="I2C"           n="3"/>

        <feature type="PWM"           n="6"       m="16"/>

        <feature type="UART"          n="2"       m="230400"/>

        <feature type="IOs"           n="40"/>

        <feature type="Timer"         n="3"       m="32"/>

        <feature type="WDT"           n="1"       name="16 bit Watchdog timer"/>

        <feature type="TimerOther"    n="1"       name="32 bit Wake-up timer"/>

        <feature type="DMA"           n="22"     />        

        <feature type="NVIC"          n="54"     />        

        <feature type="TempSens"      n="1"     />        

        <feature type="Temp"          n="-40"     m="105"/>

        <feature type="VCC"           n="2.9"    m="3.60"/>

		  <feature type="PowerOther"	  n="1"		name="3.3V/1.8V/1.2V for digital I/O"/>

        <feature type="BGA"           n="81"/>

        <compile header="ADuCM410/common/ADuCM410.h"  define="ADuCM410"/>

      </device>

      

    </family>

  </devices>



  <!-- boards section (mandatory for Board Support Packs) -->

   <boards>

      <board vendor="Analog Devices" name="EVAL-ADuCM410EVB" revision="Rev. A" orderForm="http://www.analog.com/en/evaluation/eval-ADuCM410/eb.html">

      <mountedDevice    deviceIndex="0" Dvendor="Analog Devices:1" Dname="ADuCM410"/>

      </board>

   </boards>

  

   <conditions>

      <condition id="ADuCM410">

         <description>ADuCM410 device</description>

         <require Dvendor="Analog Devices:1"/>

         <require Dname="ADuCM410"/>

      </condition>

    <condition id="ADuCM410 CMSIS Device">

      <description>ADuCM410 CMSIS Device</description>

      <require Cclass ="CMSIS" Cgroup="CORE" />

      <require condition="ADuCM410"/>

    </condition>

    <condition id="ADuCM410 Library">

