vvpai9/Keil/Keil_v5/ARM/Pack/.Web/AnalogDevices.ADuCM410_DFP.pdsc
      <description>Low Level Peripheral Libraries for ADuCM410</description>

      <require condition="ADuCM410"/>

    </condition>

    <condition id="ADuCM41x_ARM">

      <description>ADuCM41x device for KEIL</description>

      <require Tcompiler="ARMCC"/>

    </condition>

    <condition id="ADuCM41x_IAR">

      <description>ADuCM41x device for IAR</description>

      <require Tcompiler="IAR"/>

    </condition>

  </conditions> 

  

   <components>

    <component Cclass="Device" Cgroup="Startup"  Cversion="1.7.0" Cvendor="Analog Devices" condition="ADuCM410 CMSIS Device">

      <!-- Cversion is necessary -->

      <description>System Startup for ADuCM410</description>

      <files>

        <!-- additional include path -->

		    <file category="include" name="ADuCM410/common/"/>

        <!-- startup files -->

        <file category="source" name="ADuCM410/common/ARM/startup_ADuCM410.s" version="1.7.0" condition="ADuCM41x_ARM"/>

        <file category="source" name="ADuCM410/common/IAR/startup_ADuCM410.s" version="1.7.0" condition="ADuCM41x_IAR"/>

        <file category="source" name="ADuCM410/common/system_ADuCM410.c" version="1.7.0" condition="ADuCM41x_ARM"/>

        <file category="source" name="ADuCM410/common/system_ADuCM410.c" version="1.7.0" condition="ADuCM41x_IAR"/>

        <!-- system files -->

        <!--<file category="source" name="ADuCM410/common/system_ADuCM410.c" version="1.7.0" attr="config"  /> -->

      </files>

    </component>

    

    <component Cclass="Device" Cgroup="Peripheral Libraries" Csub="WDT" Cversion="1.7.0" condition="ADuCM410 Library">

         <description>Watch dog timer low level library for ADuCM410</description>

         <files>

            <file category="header" attr="config" name="ADuCM410/common/WdtLib.h" version="1.7.0"/>

            <file category="source" attr="config" name="ADuCM410/common/WdtLib.c" version="1.7.0"/>

         </files>

      </component>



    <component Cclass="Device" Cgroup="Peripheral Libraries" Csub="Common" Cversion="1.7.0" condition="ADuCM410 Library">

         <description>common file that required for all ADuCM410 projects</description>

         <files>

            <file category="header" attr="config" name="ADuCM410/common/common.h" version="1.7.0"/>

            <file category="source" attr="config" name="ADuCM410/common/common.c" version="1.7.0"/>

         </files>

    </component>

		

		<component Cclass="Device" Cgroup="Peripheral Libraries" Csub="FLASH" Cversion="1.7.0" condition="ADuCM410 Library">

         <description>Flash controller low level library for ADuCM410</description>

         <files>

            <file category="header" attr="config" name="ADuCM410/common/FeeLib.h" version="1.7.0"/>

            <file category="source" attr="config" name="ADuCM410/common/FeeLib.c" version="1.7.0"/>

         </files>

      </component>

		

		<component Cclass="Device" Cgroup="Peripheral Libraries" Csub="UART" Cversion="1.7.0" condition="ADuCM410 Library">

         <description>UART low level library for ADuCM410</description>

         <files>

            <file category="header" attr="config" name="ADuCM410/common/UrtLib.h" version="1.7.0"/>

            <file category="source" attr="config" name="ADuCM410/common/UrtLib.c" version="1.7.0"/>

         </files>

      </component>

		

		<component Cclass="Device" Cgroup="Peripheral Libraries" Csub="DMA" Cversion="1.7.0" condition="ADuCM410 Library">

         <description>DMA low level library for ADuCM410</description>

         <files>

            <file category="header" attr="config" name="ADuCM410/common/DmaLib.h" version="1.7.0"/>

            <file category="source" attr="config" name="ADuCM410/common/DmaLib.c" version="1.7.0"/>

         </files>

      </component>

		

		<component Cclass="Device" Cgroup="Peripheral Libraries" Csub="GPIO" Cversion="1.7.0" condition="ADuCM410 Library">

         <description>GPIO low level library for ADuCM410</description>

         <files>

            <file category="header" attr="config" name="ADuCM410/common/DioLib.h" version="1.7.0"/>

            <file category="source" attr="config" name="ADuCM410/common/DioLib.c" version="1.7.0"/>

         </files>

      </component>

		

		<component Cclass="Device" Cgroup="Peripheral Libraries" Csub="CLOCK" Cversion="1.7.0" condition="ADuCM410 Library">

         <description>Clock low level library for ADuCM410</description>

         <files>

            <file category="header" attr="config" name="ADuCM410/common/ClkLib.h" version="1.7.0"/>

            <file category="source" attr="config" name="ADuCM410/common/ClkLib.c" version="1.7.0"/>

         </files>

      </component>



      <component Cclass="Device" Cgroup="Peripheral Libraries" Csub="COMPARATOR" Cversion="1.7.0" condition="ADuCM410 Library">

         <description>Analog Comparator low level library for ADuCM410</description>

         <files>

            <file category="header" attr="config" name="ADuCM410/common/CmpLib.h" version="1.7.0"/>

            <file category="source" attr="config" name="ADuCM410/common/CmpLib.c" version="1.7.0"/>

         </files>

      </component>



      <component Cclass="Device" Cgroup="Peripheral Libraries" Csub="CRC" Cversion="1.7.0" condition="ADuCM410 Library">

         <description>CRC low level library for ADuCM410</description>

         <files>

            <file category="header" attr="config" name="ADuCM410/common/CrcLib.h" version="1.7.0"/>

            <file category="source" attr="config" name="ADuCM410/common/CrcLib.c" version="1.7.0"/>

         </files>

      </component>



      <component Cclass="Device" Cgroup="Peripheral Libraries" Csub="Timer" Cversion="1.7.0" condition="ADuCM410 Library">

         <description>General Purpose Timer low level library for ADuCM410</description>

         <files>

            <file category="header" attr="config" name="ADuCM410/common/GptLib.h" version="1.7.0"/>

