vvpai9/Keil/Keil_v5/ARM/Pack/.Web/AnalogDevices.ADuCM410_DFP.pdsc
            <file category="source" attr="config" name="ADuCM410/common/GptLib.c" version="1.7.0"/>

         </files>

      </component>



      <component Cclass="Device" Cgroup="Peripheral Libraries" Csub="I2C" Cversion="1.7.0" condition="ADuCM410 Library">

         <description>I2C interface low level library for ADuCM410</description>

         <files>

            <file category="header" attr="config" name="ADuCM410/common/I2cLib.h" version="1.7.0"/>

            <file category="source" attr="config" name="ADuCM410/common/I2cLib.c" version="1.7.0"/>

         </files>

      </component>



      <component Cclass="Device" Cgroup="Peripheral Libraries" Csub="MDIO" Cversion="1.7.0" condition="ADuCM410 Library">

         <description>MDIO interface low level library for ADuCM410</description>

         <files>

            <file category="header" attr="config" name="ADuCM410/common/MdLib.h" version="1.7.0"/>

            <file category="source" attr="config" name="ADuCM410/common/MdLib.c" version="1.7.0"/>

         </files>

      </component>



      <component Cclass="Device" Cgroup="Peripheral Libraries" Csub="PLA" Cversion="1.7.0" condition="ADuCM410 Library">

         <description>Programmable Logic Array low level library for ADuCM410</description>

         <files>

            <file category="header" attr="config" name="ADuCM410/common/PlaLib.h" version="1.7.0"/>

            <file category="source" attr="config" name="ADuCM410/common/PlaLib.c" version="1.7.0"/>

         </files>

      </component>



      <component Cclass="Device" Cgroup="Peripheral Libraries" Csub="PWM" Cversion="1.7.0" condition="ADuCM410 Library">

         <description>Pulse Width Modulation low level library for ADuCM410</description>

         <files>

            <file category="header" attr="config" name="ADuCM410/common/PwmLib.h" version="1.7.0"/>

            <file category="source" attr="config" name="ADuCM410/common/PwmLib.c" version="1.7.0"/>

         </files>

      </component>



      <component Cclass="Device" Cgroup="Peripheral Libraries" Csub="SPI" Cversion="1.7.0" condition="ADuCM410 Library">

         <description>SPI interface low level library for ADuCM410</description>

         <files>

            <file category="header" attr="config" name="ADuCM410/common/SpiLib.h" version="1.7.0"/>

            <file category="source" attr="config" name="ADuCM410/common/SpiLib.c" version="1.7.0"/>

         </files>

      </component>



      <component Cclass="Device" Cgroup="Peripheral Libraries" Csub="WUT" Cversion="1.7.0" condition="ADuCM410 Library">

         <description>Wake up timer low level library for ADuCM410</description>

         <files>

            <file category="header" attr="config" name="ADuCM410/common/WutLib.h" version="1.7.0"/>

            <file category="source" attr="config" name="ADuCM410/common/WutLib.c" version="1.7.0"/>

         </files>

      </component>



      <component Cclass="Device" Cgroup="Peripheral Libraries" Csub="ADC" Cversion="1.7.0" condition="ADuCM410 Library">

         <description>ADC and PGA low level library for ADuCM410</description>

         <files>

            <file category="header" attr="config" name="ADuCM410/common/AdcLib.h" version="1.7.0"/>

            <file category="source" attr="config" name="ADuCM410/common/AdcLib.c" version="1.7.0"/>

         </files>

      </component>

 

      <component Cclass="Device" Cgroup="Peripheral Libraries" Csub="DAC" Cversion="1.7.0" condition="ADuCM410 Library">

         <description>DAC low level library for ADuCM410</description>

         <files>

            <file category="header" attr="config" name="ADuCM410/common/DacLib.h" version="1.7.0"/>

            <file category="source" attr="config" name="ADuCM410/common/DacLib.c" version="1.7.0"/>

         </files>

      </component> 



      <component Cclass="Device" Cgroup="Peripheral Libraries" Csub="INT" Cversion="1.7.0" condition="ADuCM410 Library">

         <description>External interrupt library for ADuCM410</description>

         <files>

            <file category="header" attr="config" name="ADuCM410/common/IntLib.h" version="1.7.0"/>

            <file category="source" attr="config" name="ADuCM410/common/IntLib.c" version="1.7.0"/>

         </files>

      </component> 



      <component Cclass="Device" Cgroup="Peripheral Libraries" Csub="PWR" Cversion="1.7.0" condition="ADuCM410 Library">

         <description>Power Management low level library for ADuCM410</description>

         <files>

            <file category="header" attr="config" name="ADuCM410/common/PwrLib.h" version="1.7.0"/>

            <file category="source" attr="config" name="ADuCM410/common/PwrLib.c" version="1.7.0"/>

         </files>

      </component> 



   </components>

	

	  <!-- examples section (optional for all Software Packs), this section will be filled by-->

   <examples>



   <example name="M410_Adc" doc="Abstract.txt" folder="ADuCM410/examples/M410_Adc">
      <description>M410_Adc</description> 
      <board name="EVAL-ADuCM410EVB" vendor="Analog Devices" /> 
      <project>
         <environment name="uv" load="ARM/M410_Adc.uvprojx"/>
         <environment name="iar" load="IAR/M410_Adc.ewp"/>
      </project>
      <attributes>
          <component Cclass="CMSIS" Cgroup="CORE" />
          <component Cclass="Device" Cgroup="Startup" />
          <component Cclass="Device" Cgroup="Peripheral Libraries" />
        <category>Analog Peripheral</category>
        <keyword>M410_Adc</keyword>
      </attributes>
   </example>
 
   <example name="M410_AdcSeq" doc="Abstract.txt" folder="ADuCM410/examples/M410_AdcSeq">
      <description>M410_AdcSeq</description> 
      <board name="EVAL-ADuCM410EVB" vendor="Analog Devices" /> 
      <project>
         <environment name="uv" load="ARM/M410_AdcSeq.uvprojx"/>
         <environment name="iar" load="IAR/M410_AdcSeq.ewp"/>
      </project>
      <attributes>
          <component Cclass="CMSIS" Cgroup="CORE" />
          <component Cclass="Device" Cgroup="Startup" />
          <component Cclass="Device" Cgroup="Peripheral Libraries" />
        <category>Analog Peripheral</category>
        <keyword>M410_AdcSeq</keyword>
      </attributes>
   </example>
 
   <example name="M410_CMP" doc="Abstract.txt" folder="ADuCM410/examples/M410_CMP">
      <description>M410_CMP</description> 
      <board name="EVAL-ADuCM410EVB" vendor="Analog Devices" /> 
      <project>
         <environment name="uv" load="ARM/M410_CMP.uvprojx"/>
         <environment name="iar" load="IAR/M410_CMP.ewp"/>
      </project>
      <attributes>
          <component Cclass="CMSIS" Cgroup="CORE" />
          <component Cclass="Device" Cgroup="Startup" />
          <component Cclass="Device" Cgroup="Peripheral Libraries" />
        <category>Analog Peripheral</category>
        <keyword>M410_CMP</keyword>
      </attributes>
   </example>
 
   <example name="M410_ClkTest" doc="Abstract.txt" folder="ADuCM410/examples/M410_ClkTest">
      <description>M410_ClkTest</description> 
      <board name="EVAL-ADuCM410EVB" vendor="Analog Devices" /> 
      <project>
         <environment name="uv" load="ARM/M410_ClkTest.uvprojx"/>
         <environment name="iar" load="IAR/M410_ClkTest.ewp"/>
      </project>
      <attributes>
          <component Cclass="CMSIS" Cgroup="CORE" />
          <component Cclass="Device" Cgroup="Startup" />
          <component Cclass="Device" Cgroup="Peripheral Libraries" />
        <category>Analog Peripheral</category>
        <keyword>M410_ClkTest</keyword>
      </attributes>
   </example>
 
   <example name="M410_DAC" doc="Abstract.txt" folder="ADuCM410/examples/M410_DAC">
      <description>M410_DAC</description> 
      <board name="EVAL-ADuCM410EVB" vendor="Analog Devices" /> 
      <project>
         <environment name="uv" load="ARM/M410_DAC.uvprojx"/>
         <environment name="iar" load="IAR/M410_DAC.ewp"/>
      </project>
      <attributes>
          <component Cclass="CMSIS" Cgroup="CORE" />
          <component Cclass="Device" Cgroup="Startup" />
          <component Cclass="Device" Cgroup="Peripheral Libraries" />
        <category>Analog Peripheral</category>
        <keyword>M410_DAC</keyword>
      </attributes>
   </example>
 
   <example name="M410_FlashDma" doc="Abstract.txt" folder="ADuCM410/examples/M410_FlashDma">
      <description>M410_FlashDma</description> 
      <board name="EVAL-ADuCM410EVB" vendor="Analog Devices" /> 
      <project>
         <environment name="uv" load="ARM/M410_FlashDma.uvprojx"/>
         <environment name="iar" load="IAR/M410_FlashDma.ewp"/>
      </project>
      <attributes>
          <component Cclass="CMSIS" Cgroup="CORE" />
          <component Cclass="Device" Cgroup="Startup" />
          <component Cclass="Device" Cgroup="Peripheral Libraries" />
        <category>Analog Peripheral</category>
        <keyword>M410_FlashDma</keyword>
      </attributes>
   </example>
 
   <example name="M410_Flash" doc="Abstract.txt" folder="ADuCM410/examples/M410_Flash">
      <description>M410_Flash</description> 
      <board name="EVAL-ADuCM410EVB" vendor="Analog Devices" /> 
      <project>
         <environment name="uv" load="ARM/M410_Flash.uvprojx"/>
         <environment name="iar" load="IAR/M410_Flash.ewp"/>
      </project>
      <attributes>
          <component Cclass="CMSIS" Cgroup="CORE" />
          <component Cclass="Device" Cgroup="Startup" />
          <component Cclass="Device" Cgroup="Peripheral Libraries" />
        <category>Analog Peripheral</category>
        <keyword>M410_Flash</keyword>
      </attributes>
   </example>
 
