vvpai9/Keil/Keil_v5/ARM/Pack/.Web/AnalogDevices.ADuCM410_DFP.pdsc
   <example name="M410_Gpt" doc="Abstract.txt" folder="ADuCM410/examples/M410_Gpt">
      <description>M410_Gpt</description> 
      <board name="EVAL-ADuCM410EVB" vendor="Analog Devices" /> 
      <project>
         <environment name="uv" load="ARM/M410_Gpt.uvprojx"/>
         <environment name="iar" load="IAR/M410_Gpt.ewp"/>
      </project>
      <attributes>
          <component Cclass="CMSIS" Cgroup="CORE" />
          <component Cclass="Device" Cgroup="Startup" />
          <component Cclass="Device" Cgroup="Peripheral Libraries" />
        <category>Analog Peripheral</category>
        <keyword>M410_Gpt</keyword>
      </attributes>
   </example>
 
   <example name="M410_I2CBasic_Master" doc="Abstract.txt" folder="ADuCM410/examples/M410_I2CBasic_Master">
      <description>M410_I2CBasic_Master</description> 
      <board name="EVAL-ADuCM410EVB" vendor="Analog Devices" /> 
      <project>
         <environment name="uv" load="ARM/M410_I2CBasic_Master.uvprojx"/>
         <environment name="iar" load="IAR/M410_I2CBasic_Master.ewp"/>
      </project>
      <attributes>
          <component Cclass="CMSIS" Cgroup="CORE" />
          <component Cclass="Device" Cgroup="Startup" />
          <component Cclass="Device" Cgroup="Peripheral Libraries" />
        <category>Analog Peripheral</category>
        <keyword>M410_I2CBasic_Master</keyword>
      </attributes>
   </example>
 
   <example name="M410_I2CBasic_Slave" doc="Abstract.txt" folder="ADuCM410/examples/M410_I2CBasic_Slave">
      <description>M410_I2CBasic_Slave</description> 
      <board name="EVAL-ADuCM410EVB" vendor="Analog Devices" /> 
      <project>
         <environment name="uv" load="ARM/M410_I2CBasic_Slave.uvprojx"/>
         <environment name="iar" load="IAR/M410_I2CBasic_Slave.ewp"/>
      </project>
      <attributes>
          <component Cclass="CMSIS" Cgroup="CORE" />
          <component Cclass="Device" Cgroup="Startup" />
          <component Cclass="Device" Cgroup="Peripheral Libraries" />
        <category>Analog Peripheral</category>
        <keyword>M410_I2CBasic_Slave</keyword>
      </attributes>
   </example>
 
   <example name="M410_Mdio" doc="Abstract.txt" folder="ADuCM410/examples/M410_Mdio">
      <description>M410_Mdio</description> 
      <board name="EVAL-ADuCM410EVB" vendor="Analog Devices" /> 
      <project>
         <environment name="uv" load="ARM/M410_Mdio.uvprojx"/>
         <environment name="iar" load="IAR/M410_Mdio.ewp"/>
      </project>
      <attributes>
          <component Cclass="CMSIS" Cgroup="CORE" />
          <component Cclass="Device" Cgroup="Startup" />
          <component Cclass="Device" Cgroup="Peripheral Libraries" />
        <category>Analog Peripheral</category>
        <keyword>M410_Mdio</keyword>
      </attributes>
   </example>
 
   <example name="M410_PgaAcMode" doc="Abstract.txt" folder="ADuCM410/examples/M410_PgaAcMode">
      <description>M410_PgaAcMode</description> 
      <board name="EVAL-ADuCM410EVB" vendor="Analog Devices" /> 
      <project>
         <environment name="uv" load="ARM/M410_PgaAcMode.uvprojx"/>
         <environment name="iar" load="IAR/M410_PgaAcMode.ewp"/>
      </project>
      <attributes>
          <component Cclass="CMSIS" Cgroup="CORE" />
          <component Cclass="Device" Cgroup="Startup" />
          <component Cclass="Device" Cgroup="Peripheral Libraries" />
        <category>Analog Peripheral</category>
        <keyword>M410_PgaAcMode</keyword>
      </attributes>
   </example>
 
   <example name="M410_Tia" doc="Abstract.txt" folder="ADuCM410/examples/M410_Tia">
      <description>M410_Tia</description> 
      <board name="EVAL-ADuCM410EVB" vendor="Analog Devices" /> 
      <project>
         <environment name="uv" load="ARM/M410_Tia.uvprojx"/>
         <environment name="iar" load="IAR/M410_Tia.ewp"/>
      </project>
      <attributes>
          <component Cclass="CMSIS" Cgroup="CORE" />
          <component Cclass="Device" Cgroup="Startup" />
          <component Cclass="Device" Cgroup="Peripheral Libraries" />
        <category>Analog Peripheral</category>
        <keyword>M410_Tia</keyword>
      </attributes>
   </example>
 
   <example name="M410_Uart" doc="Abstract.txt" folder="ADuCM410/examples/M410_Uart">
      <description>M410_Uart</description> 
      <board name="EVAL-ADuCM410EVB" vendor="Analog Devices" /> 
      <project>
         <environment name="uv" load="ARM/M410_Uart.uvprojx"/>
         <environment name="iar" load="IAR/M410_Uart.ewp"/>
      </project>
      <attributes>
          <component Cclass="CMSIS" Cgroup="CORE" />
          <component Cclass="Device" Cgroup="Startup" />
          <component Cclass="Device" Cgroup="Peripheral Libraries" />
        <category>Analog Peripheral</category>
        <keyword>M410_Uart</keyword>
      </attributes>
   </example>
 
   <example name="M410_Wdt" doc="Abstract.txt" folder="ADuCM410/examples/M410_Wdt">
      <description>M410_Wdt</description> 
      <board name="EVAL-ADuCM410EVB" vendor="Analog Devices" /> 
      <project>
         <environment name="uv" load="ARM/M410_Wdt.uvprojx"/>
         <environment name="iar" load="IAR/M410_Wdt.ewp"/>
      </project>
      <attributes>
          <component Cclass="CMSIS" Cgroup="CORE" />
          <component Cclass="Device" Cgroup="Startup" />
          <component Cclass="Device" Cgroup="Peripheral Libraries" />
        <category>Analog Peripheral</category>
        <keyword>M410_Wdt</keyword>
      </attributes>
   </example>
 
   <example name="M410_SpiMaster" doc="Abstract.txt" folder="ADuCM410/examples/M410_SpiMaster">
      <description>M410_SpiMaster</description> 
      <board name="EVAL-ADuCM410EVB" vendor="Analog Devices" /> 
      <project>
         <environment name="uv" load="ARM/M410_SpiMaster.uvprojx"/>
         <environment name="iar" load="IAR/M410_SpiMaster.ewp"/>
      </project>
      <attributes>
          <component Cclass="CMSIS" Cgroup="CORE" />
          <component Cclass="Device" Cgroup="Startup" />
          <component Cclass="Device" Cgroup="Peripheral Libraries" />
        <category>Analog Peripheral</category>
        <keyword>M410_SpiMaster</keyword>
      </attributes>
   </example>
 
