vvpai9/Keil/Keil_v5/ARM/Pack/.Web/AnalogDevices.ADuCM410_DFP.pdsc
   <example name="M410_SpiDma" doc="Abstract.txt" folder="ADuCM410/examples/M410_SpiDma">
      <description>M410_SpiDma</description> 
      <board name="EVAL-ADuCM410EVB" vendor="Analog Devices" /> 
      <project>
         <environment name="uv" load="ARM/M410_SpiDma.uvprojx"/>
         <environment name="iar" load="IAR/M410_SpiDma.ewp"/>
      </project>
      <attributes>
          <component Cclass="CMSIS" Cgroup="CORE" />
          <component Cclass="Device" Cgroup="Startup" />
          <component Cclass="Device" Cgroup="Peripheral Libraries" />
        <category>Analog Peripheral</category>
        <keyword>M410_SpiDma</keyword>
      </attributes>
   </example>
 
   <example name="M410_SpiRxDma" doc="Abstract.txt" folder="ADuCM410/examples/M410_SpiRxDma">
      <description>M410_SpiRxDma</description> 
      <board name="EVAL-ADuCM410EVB" vendor="Analog Devices" /> 
      <project>
         <environment name="uv" load="ARM/M410_SpiRxDma.uvprojx"/>
         <environment name="iar" load="IAR/M410_SpiRxDma.ewp"/>
      </project>
      <attributes>
          <component Cclass="CMSIS" Cgroup="CORE" />
          <component Cclass="Device" Cgroup="Startup" />
          <component Cclass="Device" Cgroup="Peripheral Libraries" />
        <category>Analog Peripheral</category>
        <keyword>M410_SpiRxDma</keyword>
      </attributes>
   </example>
 
   <example name="M410_GPIO" doc="Abstract.txt" folder="ADuCM410/examples/M410_GPIO">
      <description>M410_GPIO</description> 
      <board name="EVAL-ADuCM410EVB" vendor="Analog Devices" /> 
      <project>
         <environment name="uv" load="ARM/M410_GPIO.uvprojx"/>
         <environment name="iar" load="IAR/M410_GPIO.ewp"/>
      </project>
      <attributes>
          <component Cclass="CMSIS" Cgroup="CORE" />
          <component Cclass="Device" Cgroup="Startup" />
          <component Cclass="Device" Cgroup="Peripheral Libraries" />
        <category>Analog Peripheral</category>
        <keyword>M410_GPIO</keyword>
      </attributes>
   </example>
 
   <example name="M410_Int" doc="Abstract.txt" folder="ADuCM410/examples/M410_Int">
      <description>M410_Int</description> 
      <board name="EVAL-ADuCM410EVB" vendor="Analog Devices" /> 
      <project>
         <environment name="uv" load="ARM/M410_Int.uvprojx"/>
         <environment name="iar" load="IAR/M410_Int.ewp"/>
      </project>
      <attributes>
          <component Cclass="CMSIS" Cgroup="CORE" />
          <component Cclass="Device" Cgroup="Startup" />
          <component Cclass="Device" Cgroup="Peripheral Libraries" />
        <category>Analog Peripheral</category>
        <keyword>M410_Int</keyword>
      </attributes>
   </example>
 
   <example name="M410_DmaDacAdc" doc="Abstract.txt" folder="ADuCM410/examples/M410_DmaDacAdc">
      <description>M410_DmaDacAdc</description> 
      <board name="EVAL-ADuCM410EVB" vendor="Analog Devices" /> 
      <project>
         <environment name="uv" load="ARM/M410_DmaDacAdc.uvprojx"/>
         <environment name="iar" load="IAR/M410_DmaDacAdc.ewp"/>
      </project>
      <attributes>
          <component Cclass="CMSIS" Cgroup="CORE" />
          <component Cclass="Device" Cgroup="Startup" />
          <component Cclass="Device" Cgroup="Peripheral Libraries" />
        <category>Analog Peripheral</category>
        <keyword>M410_DmaDacAdc</keyword>
      </attributes>
   </example>
 
   <example name="M410_DmaSpiAdc" doc="Abstract.txt" folder="ADuCM410/examples/M410_DmaSpiAdc">
      <description>M410_DmaSpiAdc</description> 
      <board name="EVAL-ADuCM410EVB" vendor="Analog Devices" /> 
      <project>
         <environment name="uv" load="ARM/M410_DmaSpiAdc.uvprojx"/>
         <environment name="iar" load="IAR/M410_DmaSpiAdc.ewp"/>
      </project>
      <attributes>
          <component Cclass="CMSIS" Cgroup="CORE" />
          <component Cclass="Device" Cgroup="Startup" />
          <component Cclass="Device" Cgroup="Peripheral Libraries" />
        <category>Analog Peripheral</category>
        <keyword>M410_DmaSpiAdc</keyword>
      </attributes>
   </example>
 
   <example name="M410_SpiMdio" doc="Abstract.txt" folder="ADuCM410/examples/M410_SpiMdio">
      <description>M410_SpiMdio</description> 
      <board name="EVAL-ADuCM410EVB" vendor="Analog Devices" /> 
      <project>
         <environment name="uv" load="ARM/M410_SpiMdio.uvprojx"/>
         <environment name="iar" load="IAR/M410_SpiMdio.ewp"/>
      </project>
      <attributes>
          <component Cclass="CMSIS" Cgroup="CORE" />
          <component Cclass="Device" Cgroup="Startup" />
          <component Cclass="Device" Cgroup="Peripheral Libraries" />
        <category>Analog Peripheral</category>
        <keyword>M410_SpiMdio</keyword>
      </attributes>
   </example>
 
   <example name="M410_2BlockSwap" doc="Abstract.txt" folder="ADuCM410/examples/M410_2BlockSwap">
      <description>M410_2BlockSwap</description> 
      <board name="EVAL-ADuCM410EVB" vendor="Analog Devices" /> 
      <project>
         <environment name="uv" load="ARM/M410_2BlockSwap.uvprojx"/>
         <environment name="iar" load="IAR/M410_2BlockSwap.ewp"/>
      </project>
      <attributes>
          <component Cclass="CMSIS" Cgroup="CORE" />
          <component Cclass="Device" Cgroup="Startup" />
          <component Cclass="Device" Cgroup="Peripheral Libraries" />
        <category>Analog Peripheral</category>
        <keyword>M410_2BlockSwap</keyword>
      </attributes>
   </example>
 
   <example name="M410_FPU" doc="Abstract.txt" folder="ADuCM410/examples/M410_FPU">
      <description>M410_FPU</description> 
      <board name="EVAL-ADuCM410EVB" vendor="Analog Devices" /> 
      <project>
         <environment name="uv" load="ARM/M410_FPU.uvprojx"/>
         <environment name="iar" load="IAR/M410_FPU.ewp"/>
      </project>
      <attributes>
          <component Cclass="CMSIS" Cgroup="CORE" />
          <component Cclass="Device" Cgroup="Startup" />
          <component Cclass="Device" Cgroup="Peripheral Libraries" />
        <category>Analog Peripheral</category>
        <keyword>M410_FPU</keyword>
      </attributes>
   </example>
 
   <example name="M410_SramMode" doc="Abstract.txt" folder="ADuCM410/examples/M410_SramMode">
      <description>M410_SramMode</description> 
      <board name="EVAL-ADuCM410EVB" vendor="Analog Devices" /> 
      <project>
         <environment name="uv" load="ARM/M410_SramMode.uvprojx"/>
         <environment name="iar" load="IAR/M410_SramMode.ewp"/>
      </project>
      <attributes>
          <component Cclass="CMSIS" Cgroup="CORE" />
          <component Cclass="Device" Cgroup="Startup" />
          <component Cclass="Device" Cgroup="Peripheral Libraries" />
        <category>Analog Peripheral</category>
        <keyword>M410_SramMode</keyword>
      </attributes>
   </example>
 
   <example name="M410_MPU" doc="Abstract.txt" folder="ADuCM410/examples/M410_MPU">
      <description>M410_MPU</description> 
      <board name="EVAL-ADuCM410EVB" vendor="Analog Devices" /> 
      <project>
         <environment name="uv" load="ARM/M410_MPU.uvprojx"/>
         <environment name="iar" load="IAR/M410_MPU.ewp"/>
      </project>
      <attributes>
          <component Cclass="CMSIS" Cgroup="CORE" />
          <component Cclass="Device" Cgroup="Startup" />
          <component Cclass="Device" Cgroup="Peripheral Libraries" />
        <category>Analog Peripheral</category>
        <keyword>M410_MPU</keyword>
      </attributes>
   </example>
 
   <example name="M410_I2CSlave_Dma" doc="Abstract.txt" folder="ADuCM410/examples/M410_I2CSlave_Dma">
      <description>M410_I2CSlave_Dma</description> 
      <board name="EVAL-ADuCM410EVB" vendor="Analog Devices" /> 
      <project>
         <environment name="uv" load="ARM/M410_I2CSlave_Dma.uvprojx"/>
         <environment name="iar" load="IAR/M410_I2CSlave_Dma.ewp"/>
      </project>
      <attributes>
          <component Cclass="CMSIS" Cgroup="CORE" />
          <component Cclass="Device" Cgroup="Startup" />
          <component Cclass="Device" Cgroup="Peripheral Libraries" />
        <category>Analog Peripheral</category>
        <keyword>M410_I2CSlave_Dma</keyword>
      </attributes>
   </example>
 
   <example name="M410_PWM" doc="Abstract.txt" folder="ADuCM410/examples/M410_PWM">
      <description>M410_PWM</description> 
      <board name="EVAL-ADuCM410EVB" vendor="Analog Devices" /> 
      <project>
         <environment name="uv" load="ARM/M410_PWM.uvprojx"/>
         <environment name="iar" load="IAR/M410_PWM.ewp"/>
      </project>
      <attributes>
          <component Cclass="CMSIS" Cgroup="CORE" />
          <component Cclass="Device" Cgroup="Startup" />
          <component Cclass="Device" Cgroup="Peripheral Libraries" />
        <category>Analog Peripheral</category>
        <keyword>M410_PWM</keyword>
      </attributes>
   </example>
 
   <example name="M410_PLA_HDL" doc="Abstract.txt" folder="ADuCM410/examples/M410_PLA_HDL">
      <description>M410_PLA_HDL</description> 
      <board name="EVAL-ADuCM410EVB" vendor="Analog Devices" /> 
      <project>
         <environment name="uv" load="ARM/M410_PLA_HDL.uvprojx"/>
         <environment name="iar" load="IAR/M410_PLA_HDL.ewp"/>
      </project>
      <attributes>
          <component Cclass="CMSIS" Cgroup="CORE" />
          <component Cclass="Device" Cgroup="Startup" />
          <component Cclass="Device" Cgroup="Peripheral Libraries" />
        <category>Analog Peripheral</category>
        <keyword>M410_PLA_HDL</keyword>
      </attributes>
   </example>
 
   <example name="M410_CRC" doc="Abstract.txt" folder="ADuCM410/examples/M410_CRC">
      <description>M410_CRC</description> 
      <board name="EVAL-ADuCM410EVB" vendor="Analog Devices" /> 
      <project>
         <environment name="uv" load="ARM/M410_CRC.uvprojx"/>
         <environment name="iar" load="IAR/M410_CRC.ewp"/>
      </project>
      <attributes>
          <component Cclass="CMSIS" Cgroup="CORE" />
          <component Cclass="Device" Cgroup="Startup" />
          <component Cclass="Device" Cgroup="Peripheral Libraries" />
        <category>Analog Peripheral</category>
        <keyword>M410_CRC</keyword>
      </attributes>
   </example>
 
 </examples>
 <!-- example section End -->
</package>